events/API Call Events/commit.getAllForProduct/APIResponse - commit.getAllForProduct.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
    <s:Header/>
    <s:Body>
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic/>
                <wsnt:ProducerReference>
                    <wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
                </wsnt:ProducerReference>
                <wsnt:Message>
                    <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:s2="http://www.alert-project.eu/APIcall-request" xmlns:s3="http://www.alert-project.eu/APIcall-response" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
                        <ns1:head>
                            <ns1:sender>METADATASERVICE</ns1:sender>
                            <ns1:timestamp>10000</ns1:timestamp>
                            <ns1:sequencenumber>1</ns1:sequencenumber>
                        </ns1:head>
                        <ns1:payload>
                            <ns1:meta>
                                <ns1:startTime>10010</ns1:startTime>
                                <ns1:endTime>10020</ns1:endTime>
                                <ns1:eventName>ALERT.Metadata.APICallResponse</ns1:eventName>
                                <ns1:eventId>9856</ns1:eventId>
                                <ns1:eventType>reply</ns1:eventType>
                            </ns1:meta>
                            <ns1:eventData>
                                <ns1:apiResponse>
                                    <s3:apiCall>commit.getAllForProduct</s3:apiCall>
                                    <s3:responseData>
                                        <s3:commit>
                                            <s3:commitUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Commit1</s3:commitUri>
                                            <s3:commitMessageLog>comment of commit</s3:commitMessageLog>
                                            <s3:commitDate>Mon, 16 Jan 2012 16:31:00 +0100</s3:commitDate>
                                            <s3:commitAuthor>
                                                <s3:uri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person1</s3:uri>
                                                <s3:name>Sasa Stojanovic</s3:name>
                                                <s3:id>sasa.stojanovic@cimgrupa.eu</s3:id>
                                                <s3:email>sasa.stojanovic@cimgrupa.eu</s3:email>
                                            </s3:commitAuthor>
                                            <s3:commitFileNumber>2</s3:commitFileNumber>
                                        </s3:commit>
                                        <s3:commit>
                                            <s3:commitUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Commit2</s3:commitUri>
                                            <s3:commitMessageLog>comment of commit 2</s3:commitMessageLog>
                                            <s3:commitDate>Mon, 16 Jan 2012 16:33:00 +0100</s3:commitDate>
                                            <s3:commitAuthor>
                                                <s3:uri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person2</s3:uri>
                                                <s3:name>Ivan Obradovic</s3:name>
                                                <s3:id>ivan.obradovic@cimgrupa.eu</s3:id>
                                                <s3:email>ivan.obradovic@cimgrupa.eu</s3:email>
                                            </s3:commitAuthor>
                                            <s3:commitFileNumber>1</s3:commitFileNumber>
                                        </s3:commit>
                                    </s3:responseData>
                                </ns1:apiResponse>
                            </ns1:eventData>
                        </ns1:payload>
                    </ns1:event>
                </wsnt:Message>
            </wsnt:NotificationMessage>
        </wsnt:Notify>
    </s:Body>
</s:Envelope>
